'''
У практиці програмування досить часто використовують Керівні символи. 
Це символи в кодуванні для яких не має графічного представлення, 
але які використовуються для керування пристроями, організації передачі даних та інших цілей.

Ось основні керівні символи:
 ___________________________________________
|Позначення у коді|	Опис                    |
|\n	              |Переведення рядка        |
|\f	              |Переведення сторінки     |
|\r	              |Повернення каретки       |
|\t	              |Горизонтальна табуляція  | 
|\v	              |Вертикальна табуляція    |
|_________________|_________________________|
Для того, щоб можна було вводити ці символи, додають символ, що екранує '\', який означає,
що наступний ним знак треба сприймати як спеціальний символ, а не буквально як він є.

Ці символи ми будемо активно використовувати в наступному модулі при роботі з текстовими файлами.
'''


def real_len(text):
    val = "\n", "\t", "\f", "\v", "\r"
    text = list(text)
    for v in val:
        try:
            text.remove(v)
        except ValueError:
            pass
    text = "".join(text)
    return len(text)


print(real_len('Alex\nKdfe23\t\f\v.\r'))
print(real_len('Al\nKdfe23\t\v.\r'))